# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap '1password/tap'

# Binaries
brew 'act'
brew 'awscli'
brew 'bash'
brew 'circleci'
brew 'coreutils'
brew 'fswatch'
brew 'fzf'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'mackup'
brew 'mas'
brew 'pyenv'
brew 'node'
brew 'rbenv'
brew 'rename'
brew 'terraform'
brew 'tig'
brew 'tree'
brew 'volta'
brew 'zlib'
brew 'zsh'
brew 'zsh-completions'

# Fonts
cask 'font-inter'
cask 'font-roboto-mono'

# Apps
cask '1password'
cask '1password-cli'
cask '8bitdo-ultimate-software'
cask 'arc'
cask 'audio-hijack'
cask 'bartender'
cask 'chromedriver'
cask 'chromium'
cask 'cleanshot'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'fig'
cask 'figma'
cask 'freedom'
cask 'google-drive'
cask 'hazel'
cask 'iterm2'
cask 'karabiner-elements'
cask 'ledger-live'
cask 'linear-linear'
cask 'loopback'
cask 'monitorcontrol'
cask 'notion'
cask 'pocket-casts'
cask 'postman'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qmk-toolbox'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'react-native-debugger'
cask 'rectangle'
cask 'sizzy'
cask 'slack'
cask 'sparrow'
cask 'sublime-merge'
cask 'sublime-text'
cask 'surfshark'
cask 'the-unarchiver'
cask 'via'
cask 'visual-studio-code'
cask 'zoom'

# Mac App Store
mas 'iA Writer', id: 775737590
mas 'Spark', id: 1176895641
mas 'Things', id: 904280696
mas 'Xcode', id: 497799835

# Safari Extensions
mas '1Password for Safari', id: 1569813296
mas 'Dark Reader for Safari', id: 1438243180
mas 'JSONPeep', id: 1458969831
